public class Texts {

    static String task3text = "3.\tСортировка треугольников\n" +
            " Разработать консольную программу, выполняющую вывод треугольников в порядке убывания их площади." +
            "После добавления каждого нового треугольника программа спрашивает, " +
            "хочет ли пользователь добавить ещё один.Если пользователь ответит “y” или “yes”" +
            "(без учёта регистра),программа попросит ввести данные для ещё одного треугольника, в противном случае –" +
            "выводит результат в консоль.\n  " +
            "•\tРасчёт площади треугольника должен производится по формуле Герона.\n" +
            "•\tКаждый треугольник определяется именем и длинами его сторон. \n" +
            "Формат ввода (разделитель - запятая): \n" +
            "<имя>, <длина стороны>, <длина стороны>, <длина стороны>\n" +
            "•\tПриложение должно обрабатывать ввод чисел с плавающей точкой.\n" +
            "•\tВвод должен быть нечувствителен к регистру, пробелам, табам.\n" +
            "•\tВывод данных должен быть следующем примере:\n" +
            "============= Triangles list: ===============\n" +
            "1. [Triangle first]: 17.23 сm\n" +
            "2. [Triangle 22]: 13 cm\n" +
            "3. [Triangle 1]: 1.5 cm\n";

    static String task4text = "4.\tФайловый парсер\n" +
            "Нужно написать программу, которая будет иметь два режима:\n" +
            "1.\tСчитать количество вхождений строки в текстовом файле. \n" +
            "2.\tДелать замену строки на другую в указанном файле\n" +
            "Программа должна принимать аргументы на вход при запуске:\n" +
            "1.\t<путь к файлу> <строка для подсчёта>\n" +
            "2.\t<путь к файлу> <строка для поиска> <строка для замены>\n";

    static String task5text = "" +
            " 5.	Число в пропись\n" +
            "  Нужно преобразовать целое число в прописной вариант: 12 – двенадцать. \n" +
            "Программа запускается через вызов главного класса с параметрами.";

}
